# Spark

In [1]:
# SPARK SET-UP

In [2]:
# IMPORTING DATABASES AND ASSIGNING THEIR NAMES

In [3]:
!pip install -U pyspark

Requirement already satisfied: pyspark in c:\users\naira_831868r\appdata\local\programs\python\python311\lib\site-packages (3.4.0)
Requirement already satisfied: py4j==0.10.9.7 in c:\users\naira_831868r\appdata\local\programs\python\python311\lib\site-packages (from pyspark) (0.10.9.7)

[notice] A new release of pip available: 22.3.1 -> 23.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [4]:
from pyspark.conf import SparkConf
from pyspark import SparkContext
from pyspark.sql import SQLContext

sc = SparkContext() 
config = sc.getConf()
config.set('spark.cores.max','4')
config.set('spark.executor.memory', '8G')
config.set('spark.driver.maxResultSize', '8g')
config.set('spark.kryoserializer.buffer.max', '512m')
config.set("spark.driver.cores", "4")

sc.stop()

In [5]:
sc = SparkContext(conf = config) 
sqlContext = SQLContext(sc)
print("Using Apache Spark Version", sc.version)

C:\Users\naira_831868r\AppData\Local\Programs\Python\Python311\Lib\site-packages\pyspark\sql\context.py:112: FutureWarning: Deprecated in 3.0.0. Use SparkSession.builder.getOrCreate() instead.
  warnings.warn(

Using Apache Spark Version 3.4.0

In [6]:
taxi_file = "C:/Users/naira_831868r/OneDrive/Desktop/Columbia/2021_Yellow_Taxi_Trip_Data.csv"

In [7]:
from pyspark import SparkContext
from pyspark.sql import SparkSession
spark = SparkSession.builder.master("local").appName("CsvReader").getOrCreate()
taxi_sdf = spark.read.format("csv").option("header", "true").load("C:/Users/naira_831868r/OneDrive/Desktop/Columbia/2021_Yellow_Taxi_Trip_Data.csv")
print(taxi_sdf.head(2))
taxi_sdf.count()

[Row(VendorID='1', tpep_pickup_datetime='01/01/2021 12:30:10 AM', tpep_dropoff_datetime='01/01/2021 12:36:12 AM', passenger_count='1', trip_distance='2.1', RatecodeID='1', store_and_fwd_flag='N', PULocationID='142', DOLocationID='43', payment_type='2', fare_amount='8', extra='3', mta_tax='0.5', tip_amount='0', tolls_amount='0', improvement_surcharge='0.3', total_amount='11.8', congestion_surcharge='2.5'), Row(VendorID='1', tpep_pickup_datetime='01/01/2021 12:51:20 AM', tpep_dropoff_datetime='01/01/2021 12:52:19 AM', passenger_count='1', trip_distance='0.2', RatecodeID='1', store_and_fwd_flag='N', PULocationID='238', DOLocationID='151', payment_type='2', fare_amount='3', extra='0.5', mta_tax='0.5', tip_amount='0', tolls_amount='0', improvement_surcharge='0.3', total_amount='4.3', congestion_surcharge='0')]

30904072

In [8]:
taxi_sdf.head()

Row(VendorID='1', tpep_pickup_datetime='01/01/2021 12:30:10 AM', tpep_dropoff_datetime='01/01/2021 12:36:12 AM', passenger_count='1', trip_distance='2.1', RatecodeID='1', store_and_fwd_flag='N', PULocationID='142', DOLocationID='43', payment_type='2', fare_amount='8', extra='3', mta_tax='0.5', tip_amount='0', tolls_amount='0', improvement_surcharge='0.3', total_amount='11.8', congestion_surcharge='2.5')

In [9]:
taxi_sdf = taxi_sdf.select('VendorID','tpep_pickup_datetime','passenger_count','trip_distance','PULocationID','payment_type','tip_amount','total_amount')
taxi_sdf.count()

30904072

In [10]:
taxi_sdf= taxi_sdf.na.drop()
taxi_sdf.count()

29425377

In [11]:
import pandas as pd
import numpy as np

In [12]:
taxi_sdf = taxi_sdf.limit(1000000)

In [13]:
taxi_sdf.count()

1000000

In [14]:
#Converting pyspark df to pandas df
pandasdf=taxi_sdf.toPandas()
print("Sucessful")

Sucessful

In [15]:
pandasdf.head()

,VendorID,tpep_pickup_datetime,passenger_count,trip_distance,PULocationID,payment_type,tip_amount,total_amount
0,1,01/01/2021 12:30:10 AM,1,2.1,142,2,0,11.8
1,1,01/01/2021 12:51:20 AM,1,0.2,238,2,0,4.3
2,1,01/01/2021 12:43:30 AM,1,14.7,132,1,8.65,51.95
3,1,01/01/2021 12:15:48 AM,0,10.6,138,1,6.05,36.35
4,2,01/01/2021 12:31:49 AM,1,4.94,68,1,4.06,24.36

In [16]:
# SQL SET-UP

In [17]:
!pip install -U "psycopg[binary]"

Requirement already satisfied: psycopg[binary] in c:\users\naira_831868r\appdata\local\programs\python\python311\lib\site-packages (3.1.8)
Requirement already satisfied: typing-extensions>=4.1 in c:\users\naira_831868r\appdata\local\programs\python\python311\lib\site-packages (from psycopg[binary]) (4.5.0)
Requirement already satisfied: tzdata in c:\users\naira_831868r\appdata\local\programs\python\python311\lib\site-packages (from psycopg[binary]) (2022.7)
Requirement already satisfied: psycopg-binary<=3.1.8,>=3.1.6 in c:\users\naira_831868r\appdata\local\programs\python\python311\lib\site-packages (from psycopg[binary]) (3.1.8)

[notice] A new release of pip available: 22.3.1 -> 23.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [18]:
# IMPORTING PACKAGES

In [19]:
import json
from sqlalchemy import create_engine
import psycopg, os

In [20]:
!pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in c:\users\naira_831868r\appdata\local\programs\python\python311\lib\site-packages (2.9.6)

[notice] A new release of pip available: 22.3.1 -> 23.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [21]:
# ESTABLISHING CONNECTIONS

In [22]:
conn = psycopg.connect(
    host="localhost",
    port='5432',
    dbname="apan5400termproject",
    user="postgres",
    password="123")

In [23]:
conn_url = 'postgresql://postgres:123@localhost/apan5400termproject'

In [24]:
engine = create_engine(conn_url)

In [25]:
connection = engine.connect()

In [26]:
# IMPORTING DATABASES AND ASSIGNING THEIR NAMES

In [27]:
df_zones = pd.read_csv('C:/Users/naira_831868r/OneDrive/Desktop/Columbia/taxi_zones.csv')
df_zones.head()

,OBJECTID,Shape_Leng,the_geom,Shape_Area,zone,LocationID,borough
0,1,0.116357,MULTIPOLYGON (((-74.18445299999996 40.69499599...,0.000782,Newark Airport,1,EWR
1,2,0.433470,MULTIPOLYGON (((-73.82337597260663 40.63898704...,0.004866,Jamaica Bay,2,Queens
2,3,0.084341,MULTIPOLYGON (((-73.84792614099985 40.87134223...,0.000314,Allerton/Pelham Gardens,3,Bronx
3,4,0.043567,MULTIPOLYGON (((-73.97177410965318 40.72582128...,0.000112,Alphabet City,4,Manhattan
4,5,0.092146,MULTIPOLYGON (((-74.17421738099989 40.56256808...,0.000498,Arden Heights,5,Staten Island

In [28]:
df_zones=df_zones[['zone','LocationID','borough']]
df_zones.head()

                      zone  LocationID        borough
0           Newark Airport           1            EWR
1              Jamaica Bay           2         Queens
2  Allerton/Pelham Gardens           3          Bronx
3            Alphabet City           4      Manhattan
4            Arden Heights           5  Staten Island

In [29]:
# Checking for NAs
df_zones.isnull().values.any()

False

In [30]:
# renaming locationID column in df_zones

df_zones.rename(columns={'LocationID': 'location_id', 'the_geom' : 'geom_coord'}, inplace=True)
df_zones.head()

                      zone  location_id        borough
0           Newark Airport            1            EWR
1              Jamaica Bay            2         Queens
2  Allerton/Pelham Gardens            3          Bronx
3            Alphabet City            4      Manhattan
4            Arden Heights            5  Staten Island

In [31]:
# checking for duplicates in zone data

df_zones_drop = df_zones.drop_duplicates(subset = 'location_id')
df_zones_drop.loc[df_zones['location_id'] == 56]

      zone  location_id borough
55  Corona           56  Queens

In [32]:
# CREATING EACH INDIVIDUAL TABLE

In [33]:
conn.commit()

In [34]:
cur = conn.cursor()

In [35]:
cur.execute('DROP TABLE IF EXISTS taxi_zone cascade')
conn.commit()

In [36]:
taxi_zone = """ CREATE TABLE taxi_zone (
location_id integer NOT NULL,
zone VARCHAR NOT NULL,
borough VARCHAR(1000) NOT NULL,
PRIMARY KEY (location_id)
)            
            """
cur.execute(taxi_zone)
conn.commit()

In [37]:
cur.execute('DROP TABLE IF EXISTS taxi_ride cascade')
conn.commit()

In [38]:
taxi_ride = """ CREATE TABLE taxi_ride (
ride_id integer UNIQUE NOT NULL,
vendor_id integer NOT NULL,
pickup_date VARCHAR NOT NULL,
pickup_time VARCHAR NOT NULL,
PRIMARY KEY (ride_id)
)            
            """
cur.execute(taxi_ride)
conn.commit()

In [39]:
conn.commit()

In [40]:
cur.execute('DROP TABLE IF EXISTS ride_tips cascade')
conn.commit()

In [41]:
ride_tips = """ CREATE TABLE ride_tips (
ride_id integer UNIQUE NOT NULL,
tip_amount numeric,
total_amount numeric,
tip_percentage numeric,
FOREIGN KEY (ride_id) REFERENCES taxi_ride (ride_id)
)            
            """
cur.execute(ride_tips)
conn.commit()

In [42]:
cur.execute('DROP TABLE IF EXISTS ride_distance cascade')
conn.commit()

In [43]:
ride_distance = """ CREATE TABLE ride_distance (
ride_id integer UNIQUE NOT NULL,
location_id integer NOT NULL,
trip_distance numeric NOT NULL,
FOREIGN KEY (ride_id) REFERENCES taxi_ride (ride_id),
FOREIGN KEY (location_id) REFERENCES taxi_zone (location_id)
)            
            """
cur.execute(ride_distance)
conn.commit()

In [44]:
cur.execute('DROP TABLE IF EXISTS ride_payment_type cascade')
conn.commit()

In [45]:
ride_payment_type = """ CREATE TABLE ride_payment_type (
ride_id integer UNIQUE NOT NULL,
payment_type integer NOT NULL,
FOREIGN KEY (ride_id) REFERENCES ride_tips (ride_id)
)            
            """
cur.execute(ride_payment_type)
conn.commit()

In [46]:
# adding missing values for zones 263 - 265

zones_values = """ INSERT INTO taxi_zone (location_id, zone, borough) VALUES
('264','NA', 'NA'),
('265','NA', 'NA')"""

cur.execute(zones_values)
conn.commit()

In [64]:
# adding missing values for zones 263 - 265

zones_values = """ INSERT INTO taxi_zone (location_id, zone, borough) VALUES
('57','Corona', 'Queens')"""

cur.execute(zones_values)
conn.commit()

In [47]:
# renaming VendorID, PULocationID columns in df_taxi 

pandasdf.rename(columns={'VendorID': 'vendor_id', 'PULocationID': 'location_id'}, inplace=True)
pandasdf.head()

,vendor_id,tpep_pickup_datetime,passenger_count,trip_distance,location_id,payment_type,tip_amount,total_amount
0,1,01/01/2021 12:30:10 AM,1,2.1,142,2,0,11.8
1,1,01/01/2021 12:51:20 AM,1,0.2,238,2,0,4.3
2,1,01/01/2021 12:43:30 AM,1,14.7,132,1,8.65,51.95
3,1,01/01/2021 12:15:48 AM,0,10.6,138,1,6.05,36.35
4,2,01/01/2021 12:31:49 AM,1,4.94,68,1,4.06,24.36

In [48]:
# convert the string columns to numeric columns
pandasdf['tip_amount'] = pd.to_numeric(pandasdf['tip_amount'])
pandasdf['total_amount'] = pd.to_numeric(pandasdf['total_amount'])

In [49]:
pandasdf.head()

,vendor_id,tpep_pickup_datetime,passenger_count,trip_distance,location_id,payment_type,tip_amount,total_amount
0,1,01/01/2021 12:30:10 AM,1,2.1,142,2,0.00,11.80
1,1,01/01/2021 12:51:20 AM,1,0.2,238,2,0.00,4.30
2,1,01/01/2021 12:43:30 AM,1,14.7,132,1,8.65,51.95
3,1,01/01/2021 12:15:48 AM,0,10.6,138,1,6.05,36.35
4,2,01/01/2021 12:31:49 AM,1,4.94,68,1,4.06,24.36

In [50]:
pandasdf['pickup_date'] = pandasdf['tpep_pickup_datetime'].str[:10]
pandasdf.head()

,vendor_id,tpep_pickup_datetime,passenger_count,trip_distance,location_id,payment_type,tip_amount,total_amount,pickup_date
0,1,01/01/2021 12:30:10 AM,1,2.1,142,2,0.00,11.80,01/01/2021
1,1,01/01/2021 12:51:20 AM,1,0.2,238,2,0.00,4.30,01/01/2021
2,1,01/01/2021 12:43:30 AM,1,14.7,132,1,8.65,51.95,01/01/2021
3,1,01/01/2021 12:15:48 AM,0,10.6,138,1,6.05,36.35,01/01/2021
4,2,01/01/2021 12:31:49 AM,1,4.94,68,1,4.06,24.36,01/01/2021

In [51]:
pandasdf['pickup_time'] = pandasdf['tpep_pickup_datetime'].str[11:23]
pandasdf.head()

,vendor_id,tpep_pickup_datetime,passenger_count,trip_distance,location_id,payment_type,tip_amount,total_amount,pickup_date,pickup_time
0,1,01/01/2021 12:30:10 AM,1,2.1,142,2,0.00,11.80,01/01/2021,12:30:10 AM
1,1,01/01/2021 12:51:20 AM,1,0.2,238,2,0.00,4.30,01/01/2021,12:51:20 AM
2,1,01/01/2021 12:43:30 AM,1,14.7,132,1,8.65,51.95,01/01/2021,12:43:30 AM
3,1,01/01/2021 12:15:48 AM,0,10.6,138,1,6.05,36.35,01/01/2021,12:15:48 AM
4,2,01/01/2021 12:31:49 AM,1,4.94,68,1,4.06,24.36,01/01/2021,12:31:49 AM

In [52]:
# print the resulting dataframe
pandasdf.head()

,vendor_id,tpep_pickup_datetime,passenger_count,trip_distance,location_id,payment_type,tip_amount,total_amount,pickup_date,pickup_time
0,1,01/01/2021 12:30:10 AM,1,2.1,142,2,0.00,11.80,01/01/2021,12:30:10 AM
1,1,01/01/2021 12:51:20 AM,1,0.2,238,2,0.00,4.30,01/01/2021,12:51:20 AM
2,1,01/01/2021 12:43:30 AM,1,14.7,132,1,8.65,51.95,01/01/2021,12:43:30 AM
3,1,01/01/2021 12:15:48 AM,0,10.6,138,1,6.05,36.35,01/01/2021,12:15:48 AM
4,2,01/01/2021 12:31:49 AM,1,4.94,68,1,4.06,24.36,01/01/2021,12:31:49 AM

In [53]:
# adding tip percentage column (tip_amount/total_amount)

pandasdf['tip_percentage'] = (pd.to_numeric(pandasdf['tip_amount']) / pd.to_numeric(pandasdf['total_amount'])) * 100
pandasdf.head()

,vendor_id,tpep_pickup_datetime,passenger_count,trip_distance,location_id,payment_type,tip_amount,total_amount,pickup_date,pickup_time,tip_percentage
0,1,01/01/2021 12:30:10 AM,1,2.1,142,2,0.00,11.80,01/01/2021,12:30:10 AM,0.000000
1,1,01/01/2021 12:51:20 AM,1,0.2,238,2,0.00,4.30,01/01/2021,12:51:20 AM,0.000000
2,1,01/01/2021 12:43:30 AM,1,14.7,132,1,8.65,51.95,01/01/2021,12:43:30 AM,16.650626
3,1,01/01/2021 12:15:48 AM,0,10.6,138,1,6.05,36.35,01/01/2021,12:15:48 AM,16.643741
4,2,01/01/2021 12:31:49 AM,1,4.94,68,1,4.06,24.36,01/01/2021,12:31:49 AM,16.666667

In [54]:
pandasdf['tip_percentage'] = pandasdf['tip_percentage'].round(2)
pandasdf.head()

,vendor_id,tpep_pickup_datetime,passenger_count,trip_distance,location_id,payment_type,tip_amount,total_amount,pickup_date,pickup_time,tip_percentage
0,1,01/01/2021 12:30:10 AM,1,2.1,142,2,0.00,11.80,01/01/2021,12:30:10 AM,0.00
1,1,01/01/2021 12:51:20 AM,1,0.2,238,2,0.00,4.30,01/01/2021,12:51:20 AM,0.00
2,1,01/01/2021 12:43:30 AM,1,14.7,132,1,8.65,51.95,01/01/2021,12:43:30 AM,16.65
3,1,01/01/2021 12:15:48 AM,0,10.6,138,1,6.05,36.35,01/01/2021,12:15:48 AM,16.64
4,2,01/01/2021 12:31:49 AM,1,4.94,68,1,4.06,24.36,01/01/2021,12:31:49 AM,16.67

In [55]:
# adding ride_id column to cleaned dataset

pandasdf.insert(0, 'ride_id', range(1, 1 + len(pandasdf)))
pandasdf.head()

,ride_id,vendor_id,tpep_pickup_datetime,passenger_count,trip_distance,location_id,payment_type,tip_amount,total_amount,pickup_date,pickup_time,tip_percentage
0,1,1,01/01/2021 12:30:10 AM,1,2.1,142,2,0.00,11.80,01/01/2021,12:30:10 AM,0.00
1,2,1,01/01/2021 12:51:20 AM,1,0.2,238,2,0.00,4.30,01/01/2021,12:51:20 AM,0.00
2,3,1,01/01/2021 12:43:30 AM,1,14.7,132,1,8.65,51.95,01/01/2021,12:43:30 AM,16.65
3,4,1,01/01/2021 12:15:48 AM,0,10.6,138,1,6.05,36.35,01/01/2021,12:15:48 AM,16.64
4,5,2,01/01/2021 12:31:49 AM,1,4.94,68,1,4.06,24.36,01/01/2021,12:31:49 AM,16.67

In [56]:
# importing df data into pgadmin tables
# taxi_zone table

temp_zones= df_zones_drop[['location_id', 'zone', 'borough']]
temp_zones.head()

   location_id                     zone        borough
0            1           Newark Airport            EWR
1            2              Jamaica Bay         Queens
2            3  Allerton/Pelham Gardens          Bronx
3            4            Alphabet City      Manhattan
4            5            Arden Heights  Staten Island

In [57]:
temp_zones.to_sql(name='taxi_zone', con=engine, if_exists='append', index=False)

260

In [58]:
# importing df data into pgadmin tables
# taxi_ride table

temp_taxi_ride= pandasdf[['ride_id', 'vendor_id', 'pickup_date', 'pickup_time']]
temp_taxi_ride.head()

   ride_id vendor_id pickup_date  pickup_time
0        1         1  01/01/2021  12:30:10 AM
1        2         1  01/01/2021  12:51:20 AM
2        3         1  01/01/2021  12:43:30 AM
3        4         1  01/01/2021  12:15:48 AM
4        5         2  01/01/2021  12:31:49 AM

In [59]:
temp_taxi_ride.to_sql(name='taxi_ride', con=engine, if_exists='append', index=False, chunksize=25000)

40000

In [60]:
# importing df data into pgadmin tables
# ride_tips table

temp_ride_tips= pandasdf[['ride_id', 'tip_amount', 'total_amount', 'tip_percentage']]
temp_ride_tips.head()

   ride_id  tip_amount  total_amount  tip_percentage
0        1        0.00         11.80            0.00
1        2        0.00          4.30            0.00
2        3        8.65         51.95           16.65
3        4        6.05         36.35           16.64
4        5        4.06         24.36           16.67

In [61]:
temp_ride_tips.to_sql(name='ride_tips', con=engine, if_exists='append', index=False, chunksize=25000)

40000

In [62]:
# importing df data into pgadmin tables
# ride_distance table

temp_ride_distance= pandasdf[['ride_id', 'location_id', 'trip_distance']]
temp_ride_distance.head()

   ride_id location_id trip_distance
0        1         142           2.1
1        2         238           0.2
2        3         132          14.7
3        4         138          10.6
4        5          68          4.94

In [65]:
temp_ride_distance.to_sql(name='ride_distance', con=engine, if_exists='append', index=False, chunksize=25000)

40000

In [66]:
# importing df data into pgadmin tables
# ride_payment table

temp_ride_payment_type= pandasdf[['ride_id', 'payment_type']]
temp_ride_payment_type.head()

   ride_id payment_type
0        1            2
1        2            2
2        3            1
3        4            1
4        5            1

In [67]:
temp_ride_payment_type.to_sql(name='ride_payment_type', con=engine, if_exists='append', index=False, chunksize=25000)

40000

# SQL

In [ ]:
# SQL QUERIES

In [68]:
conn.commit()

In [69]:
AVGTIPXZONE=cur.execute("""
SELECT zone, ROUND(AVG(tip_amount),2)
FROM taxi_zone
NATURAL JOIN ride_tips NATURAL JOIN ride_distance
GROUP BY zone
ORDER BY AVG(tip_amount) DESC
FETCH FIRST 5 ROWS ONLY;
""")

for item in AVGTIPXZONE:
    print(item)

('Bronx Park', Decimal('10.96'))
('Port Richmond', Decimal('7.58'))
('Baisley Park', Decimal('6.77'))
('Flushing Meadows-Corona Park', Decimal('6.62'))
('Allerton/Pelham Gardens', Decimal('6.29'))

In [70]:
AVGTIPPERXZONE=cur.execute("""
SELECT zone, ROUND(AVG(tip_percentage),2)
FROM taxi_zone
NATURAL JOIN ride_tips NATURAL JOIN ride_distance
GROUP BY zone
ORDER BY AVG(tip_percentage) DESC
FETCH FIRST 25 ROWS ONLY;
""")

for item in AVGTIPPERXZONE:
    print(item)

('East Harlem South', Decimal('Infinity'))
('Bronx Park', Decimal('17.20'))
('Queensboro Hill', Decimal('14.95'))
('Rockaway Park', Decimal('13.52'))
('Broad Channel', Decimal('13.30'))
('Meatpacking/West Village West', Decimal('12.99'))
('West Village', Decimal('12.87'))
('Battery Park City', Decimal('12.83'))
('Upper West Side South', Decimal('12.49'))
('Greenwich Village South', Decimal('12.46'))
('Central Park', Decimal('12.33'))
('Hudson Sq', Decimal('12.23'))
('Lincoln Square East', Decimal('12.11'))
('Greenwich Village North', Decimal('12.11'))
('Union Sq', Decimal('12.07'))
('Upper East Side North', Decimal('12.06'))
('Midtown East', Decimal('12.06'))
('Upper East Side South', Decimal('12.02'))
('Midtown North', Decimal('11.95'))
('SoHo', Decimal('11.93'))
('Flatiron', Decimal('11.88'))
('Lenox Hill West', Decimal('11.83'))
('Midtown Center', Decimal('11.74'))
('Sutton Place/Turtle Bay North', Decimal('11.71'))
('Murray Hill', Decimal('11.71'))

In [71]:
conn.commit()

In [72]:
# 1 is CC

COUNTPAYTYPE1=cur.execute("""
SELECT zone, borough
FROM taxi_zone
NATURAL JOIN ride_payment_type NATURAL JOIN ride_distance
WHERE payment_type=1
GROUP BY zone, borough
ORDER BY COUNT(ride_id) DESC
FETCH FIRST 5 ROWS ONLY; 
""")

for item in COUNTPAYTYPE1:
    print(item)

('Upper East Side North', 'Manhattan')
('Upper East Side South', 'Manhattan')
('Upper West Side South', 'Manhattan')
('Lenox Hill West', 'Manhattan')
('Midtown Center', 'Manhattan')

In [73]:
# 2 is Cash

COUNTPAYTYPE2=cur.execute("""
SELECT zone, borough
FROM taxi_zone
NATURAL JOIN ride_payment_type NATURAL JOIN ride_distance
WHERE payment_type=2
GROUP BY zone, borough
ORDER BY COUNT(ride_id) DESC
FETCH FIRST 5 ROWS ONLY; 
""")

for item in COUNTPAYTYPE2:
    print(item)

('Upper East Side South', 'Manhattan')
('Upper East Side North', 'Manhattan')
('JFK Airport', 'Queens')
('Penn Station/Madison Sq West', 'Manhattan')
('Lenox Hill West', 'Manhattan')

In [74]:
AVGTIPXBOROUGH=cur.execute("""
SELECT borough, ROUND(AVG(tip_amount),2)
FROM taxi_zone
NATURAL JOIN ride_tips NATURAL JOIN ride_distance
GROUP BY borough
ORDER BY AVG(tip_amount) DESC
FETCH FIRST 5 ROWS ONLY;
""")

for item in AVGTIPXBOROUGH:
    print(item)

('EWR', Decimal('6.05'))
('Queens', Decimal('4.45'))
('NA', Decimal('2.54'))
('Staten Island', Decimal('1.82'))
('Manhattan', Decimal('1.80'))

In [75]:
conn.commit()

In [76]:
AVGTIPXAIRPORTS=cur.execute("""
SELECT zone, ROUND(AVG(tip_amount),2)
FROM taxi_zone
NATURAL JOIN ride_tips NATURAL JOIN ride_distance
WHERE location_id=1
    OR location_id=132
    OR location_id=138
GROUP BY zone
ORDER BY AVG(tip_amount) DESC;
""")

for item in AVGTIPXAIRPORTS:
    print(item)

('Newark Airport', Decimal('6.05'))
('JFK Airport', Decimal('5.41'))
('LaGuardia Airport', Decimal('4.42'))

In [77]:
conn.commit()

In [78]:
AVGTIPPERXAIRPORTS=cur.execute("""
SELECT zone, ROUND(AVG(tip_percentage),2)
FROM taxi_zone
NATURAL JOIN ride_tips NATURAL JOIN ride_distance
WHERE location_id=1
    OR location_id=132
    OR location_id=138
GROUP BY zone
ORDER BY AVG(tip_percentage) DESC;
""")

for item in AVGTIPPERXAIRPORTS:
    print(item)

('LaGuardia Airport', Decimal('10.76'))
('JFK Airport', Decimal('8.81'))
('Newark Airport', Decimal('8.10'))

In [79]:
query="""
SELECT zone, ROUND(AVG(tip_percentage),2)
FROM taxi_zone
NATURAL JOIN ride_tips NATURAL JOIN ride_distance
GROUP BY zone
ORDER BY AVG(tip_percentage) DESC;
"""
cursor=conn.cursor()
cursor.execute(query)
result=cursor.fetchall()

In [80]:
df = pd.DataFrame(result)

In [81]:
df.columns = ['zone', 'tip_percentage']

In [82]:
df.head()

                zone tip_percentage
0  East Harlem South       Infinity
1         Bronx Park          17.20
2    Queensboro Hill          14.95
3      Rockaway Park          13.52
4      Broad Channel          13.30

In [122]:
#Payment type=CC

query2="""
SELECT zone, ROUND(count(ride_id),0)
FROM taxi_zone
NATURAL JOIN ride_payment_type NATURAL JOIN ride_distance
WHERE payment_type=1
GROUP BY zone
ORDER BY COUNT(ride_id) DESC; 
"""
cursor=conn.cursor()
cursor.execute(query2)
result2=cursor.fetchall()

In [123]:
df2 = pd.DataFrame(result2)

In [124]:
df2.columns = ['zone', 'count_credit']

In [125]:
df2.head()

                    zone count_credit
0  Upper East Side North        43689
1  Upper East Side South        43071
2  Upper West Side South        27301
3        Lenox Hill West        27017
4         Midtown Center        25229

In [126]:
#Payment type=Cash

query3="""
SELECT zone, ROUND(count(ride_id),0)
FROM taxi_zone
NATURAL JOIN ride_payment_type NATURAL JOIN ride_distance
WHERE payment_type=2
GROUP BY zone
ORDER BY COUNT(ride_id) DESC; 
"""
cursor=conn.cursor()
cursor.execute(query3)
result3=cursor.fetchall()

In [127]:
df3 = pd.DataFrame(result3)

In [128]:
df3.columns = ['zone', 'count_cash']

In [129]:
df3.head()

                           zone count_cash
0         Upper East Side South      12669
1         Upper East Side North      12491
2                   JFK Airport       9696
3  Penn Station/Madison Sq West       9613
4               Lenox Hill West       8240

In [130]:
#Merging df, df2
df_new = pd.merge(df, df2, on='zone', how='left')

print(df_new)

                         zone tip_percentage count_credit
0           East Harlem South       Infinity        10271
1                  Bronx Park          17.20            6
2             Queensboro Hill          14.95           13
3               Rockaway Park          13.52            2
4               Broad Channel          13.30            2
..                        ...            ...          ...
248  South Beach/Dongan Hills           0.00            2
249                    Hollis           0.00            7
250           Pelham Bay Park           0.00            2
251              Crotona Park           0.00            1
252             East Flushing           0.00            3

[253 rows x 3 columns]

In [131]:
df_new.head()

                zone tip_percentage count_credit
0  East Harlem South       Infinity        10271
1         Bronx Park          17.20            6
2    Queensboro Hill          14.95           13
3      Rockaway Park          13.52            2
4      Broad Channel          13.30            2

In [132]:
#Merging df_new, df3
df_latest = pd.merge(df_new, df3, on='zone', how='left')

print(df_latest)

                         zone tip_percentage count_credit count_cash
0           East Harlem South       Infinity        10271       7540
1                  Bronx Park          17.20            6          2
2             Queensboro Hill          14.95           13          4
3               Rockaway Park          13.52            2        NaN
4               Broad Channel          13.30            2          2
..                        ...            ...          ...        ...
248  South Beach/Dongan Hills           0.00            2          1
249                    Hollis           0.00            7          2
250           Pelham Bay Park           0.00            2        NaN
251              Crotona Park           0.00            1          1
252             East Flushing           0.00            3        NaN

[253 rows x 4 columns]

In [133]:
df_latest.head()

                zone tip_percentage count_credit count_cash
0  East Harlem South       Infinity        10271       7540
1         Bronx Park          17.20            6          2
2    Queensboro Hill          14.95           13          4
3      Rockaway Park          13.52            2        NaN
4      Broad Channel          13.30            2          2

# Flask

In [ ]:
# FLASK SET-UP

In [83]:
!pip install Flask

Requirement already satisfied: Flask in c:\users\naira_831868r\appdata\local\programs\python\python311\lib\site-packages (2.2.3)
Requirement already satisfied: Werkzeug>=2.2.2 in c:\users\naira_831868r\appdata\local\programs\python\python311\lib\site-packages (from Flask) (2.2.2)
Requirement already satisfied: Jinja2>=3.0 in c:\users\naira_831868r\appdata\local\programs\python\python311\lib\site-packages (from Flask) (3.1.2)
Requirement already satisfied: itsdangerous>=2.0 in c:\users\naira_831868r\appdata\local\programs\python\python311\lib\site-packages (from Flask) (2.1.2)
Requirement already satisfied: click>=8.0 in c:\users\naira_831868r\appdata\local\programs\python\python311\lib\site-packages (from Flask) (8.1.3)
Requirement already satisfied: colorama in c:\users\naira_831868r\appdata\local\programs\python\python311\lib\site-packages (from click>=8.0->Flask) (0.4.6)
Requirement already satisfied: MarkupSafe>=2.0 in c:\users\naira_831868r\appdata\local\programs\python\python311\lib\site-packages (from Jinja2>=3.0->Flask) (2.1.1)

[notice] A new release of pip available: 22.3.1 -> 23.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [142]:
from flask import Flask, render_template, request
import pandas as pd

app = Flask(__name__)

@app.route('/')
def index():
    return render_template('input.html')

@app.route('/result', methods=['POST'])
def result():
    # Get input from form
    name = request.form['zone']
    print(name)
    # Link input to query for output
    output = df_latest[df_latest["zone"].str.contains(name)] #where df is the sql query converted to a dataframe
    print(output)

    result  = "<style> table, th, td {border: 1px solid black;border-collapse: collapse;} h1 {text-align: center;} </style>"
    result += "<h1>Tip Details</h1><br><ul>"
    result += "<table>"    
    result += "<tr>"
    for i in output.columns:
        result +='<th>'+i+'</th>'
    result += "</tr>"
    for index, row in output.iterrows():
        result += "<tr><td>{{1}}</td><td>{{2}}</td><td>{{3}}</td><td>{{4}}</td></tr>".replace("{{1}}",str(row['zone'])).replace("{{2}}",str(row['tip_percentage'])).replace("{{3}}",str(row['count_credit'])).replace("{{4}}",str(row['count_cash']))
    result += "</table>"
    
    return result

In [143]:
app.run(host='localhost', port=9007)

 * Serving Flask app '__main__'
 * Debug mode: off

WARNING: This is a development server. Do not use it in a production deployment. Use a production WSGI server instead.
 * Running on http://localhost:9007
Press CTRL+C to quit
127.0.0.1 - - [27/Apr/2023 23:46:34] "GET / HTTP/1.1" 200 -
127.0.0.1 - - [27/Apr/2023 23:46:34] "GET /favicon.ico HTTP/1.1" 404 -
127.0.0.1 - - [27/Apr/2023 23:46:39] "POST /result HTTP/1.1" 200 -

Astoria
             zone tip_percentage count_credit count_cash
55   Astoria Park          10.53            5          2
102   Old Astoria           5.81          137        158
114       Astoria           4.94          407        651